lab85-ru/terraelectronica_boards/TE-LPC4088LCD5.6/Demo_prj/IAR-LPC4088/common/usb/usb_hw.c
/*************************************************************************
 *
 *    Used with ICCARM and AARM.
 *
 *    File name   : usb_hw.c
 *    Description : usb module (HAL)
 *
 *    History :
 *    1. Date        : April 8, 2008
 *       Author      : Stanimir Bonev
 *       Description : Create
 *        USB framework rev. 2 light version with DMA transfer support
 *
 *    $Revision: 59014 $
 **************************************************************************/
#include "lpc407x_8x.h"
#include "assert.h"
#include "board.h"
#include "arm_comm.h"
#include "usb_cnfg.h"
#include "usb_desc.h"
#define USB_HW_GLOBAL
#include "usb_hw.h"
#include "usb_t9.h"
#include "usb_buffer.h"
#include "usb_hooks.h"

#pragma diag_suppress=Pe068
   
static volatile UsbDevStat_t USB_DevStatus;

static const UsbStandardEpDescriptor_t USB_CtrlEpDescr0 =
{
  sizeof(UsbStandardEpDescriptor_t),
  UsbDescriptorEp,
  UsbEpOut(CTRL_ENP_OUT>>1),
  {(uint8_t)UsbEpTransferControl | (uint8_t)UsbEpSynchNoSynchronization | (uint8_t)UsbEpUsageData},
  Ep0MaxSize,
  0
};

static const UsbEP_ExtData_t USB_CtrlEpExtDescr0 =
{
  0
};

static const UsbStandardEpDescriptor_t USB_CtrlEpDescr1 =
{
  sizeof(UsbStandardEpDescriptor_t),
  UsbDescriptorEp,
  UsbEpIn(CTRL_ENP_IN>>1),
  {(uint8_t)UsbEpTransferControl | (uint8_t)UsbEpSynchNoSynchronization | (uint8_t)UsbEpUsageData},
  Ep0MaxSize,
  0
};

static const UsbEP_ExtData_t USB_CtrlEpExtDescr1 =
{
  0
};

static const Boolean UsbEpDoubleBuffType[] =
{
  FALSE,  // OUT 0
  FALSE,  // IN 0
  FALSE,  // OUT 1
  FALSE,  // IN 1
  TRUE,   // OUT 2
  TRUE,   // IN 2
  TRUE,   // OUT 3
  TRUE,   // IN 3
  FALSE,  // OUT 4
  FALSE,  // IN 4
  TRUE,   // OUT 5
  TRUE,   // IN 5
  TRUE,   // OUT 6
  TRUE,   // IN 6
  FALSE,  // OUT 7
  FALSE,  // IN 7
  TRUE,   // OUT 8
  TRUE,   // IN 8
  TRUE,   // OUT 9
  TRUE,   // IN 9
  FALSE,  // OUT 10
  FALSE,  // IN 10
  TRUE,   // OUT 11
  TRUE,   // IN 11
  TRUE,   // OUT 12
  TRUE,   // IN 12
  FALSE,  // OUT 13
  FALSE,  // IN 13
  TRUE,   // OUT 14
  TRUE,   // IN 14
  TRUE,   // OUT 15
  TRUE,   // IN 15
};

#if  USB_SOF_EVENT > 0
uint32_t  USB_SofNumbHold;
#endif

#if USB_DMA_DD_MAX_NUMB > 0

#pragma segment="USB_DMA_RAM"
#pragma location="USB_DMA_RAM"
#pragma data_alignment=128
__no_init pUSB_DmaDesc_t USB_DDCA[ENP_MAX_NUMB];

#pragma location="USB_DMA_RAM"
__no_init USB_DmaDesc_t USB_DmaDesc[USB_DMA_DD_MAX_NUMB];
pUSB_DmaDesc_t DmaFree[USB_DMA_DD_MAX_NUMB];

#if USB_DMA_ID_MAX_NUMB > 0
#pragma location="USB_DMA_RAM"
__no_init DmaIsoPacket_t USB_DmaIsoDesc[USB_DMA_ID_MAX_NUMB];
pDmaIsoPacket_t DmaIsoFree[USB_DMA_ID_MAX_NUMB];
#endif // USB_DMA_ID_MAX_NUMB > 0
#endif // USB_DMA_DD_MAX_NUMB > 0

/*************************************************************************
 * Function Name: USB_Cmd
 * Parameters:  uint16_t Command, uint8_t Data
 *
 * Return: uint32_t - command result
 *
 * Description: Implement commands transmit to USB Engine
 *
 *************************************************************************/
static
uint32_t USB_Cmd (uint16_t Command, uint8_t Data)
{
#if __CORE__ < 7
uint32_t Save;
#endif // __CORE__ < 7
uint32_t tmp = 0;
  // Disable interrupt and save current state of the interrupt flags
  #if __CORE__ < 7
    ENTR_CRT_SECTION(Save);
  #else
    ENTR_CRT_SECTION();
  #endif // __CORE__ < 7
  LPC_USB->DevIntClr = bmUSB_CommDataFullInterrupt | bmUSB_CommRegEmptyInterrupt;
  // Load command in USB engine
  LPC_USB->CmdCode = ((Command&0xFF) << 16) + USB_CMD_WR;
  // Wait until command is accepted
  while ((LPC_USB->DevIntSt & bmUSB_CommRegEmptyInterrupt) == 0);
  // clear Command reg. empty interrupt
  LPC_USB->DevIntClr = bmUSB_CommRegEmptyInterrupt;
  // determinate next phase of the command
  switch (Command)
  {
  case CMD_USB_SET_ADDRESS:
  case CMD_USB_CFG_DEV:
  case CMD_USB_SET_MODE:
  case CMD_USB_SET_DEV_STAT:
    LPC_USB->CmdCode = (Data << 16) + USB_DATA_WR;
    while ((LPC_USB->DevIntSt & bmUSB_CommRegEmptyInterrupt) == 0);
    break;
  case CMD_USB_RD_FRAME_NUMB:
  case CMD_USB_RD_TEST_REG:
    LPC_USB->CmdCode = (Command << 16) + USB_DATA_RD;
    while ((LPC_USB->DevIntSt & bmUSB_CommDataFullInterrupt) == 0);
    LPC_USB->DevIntClr = bmUSB_CommDataFullInterrupt;
    tmp = LPC_USB->CmdData;
    LPC_USB->CmdCode = (Command << 16) + USB_DATA_RD;
    while ((LPC_USB->DevIntSt & bmUSB_CommDataFullInterrupt) == 0);
    tmp |= LPC_USB->CmdData << 8;
    break;
  case CMD_USB_GET_DEV_STAT:
  case CMD_USB_GET_ERROR:
  case CMD_USB_RD_ERROR_STAT:
  case CMD_USB_CLR_BUF:
    LPC_USB->CmdCode = (Command << 16) + USB_DATA_RD;
    while ((LPC_USB->DevIntSt & bmUSB_CommDataFullInterrupt) == 0);
    tmp = LPC_USB->CmdData;
    break;
  default:
    switch (Command & 0x1E0)
    {
    case CMD_USB_SEL_EP:
    case CMD_USB_SEL_CLR_INT_EP:
      LPC_USB->CmdCode = (Command << 16) + USB_DATA_RD;
      while ((LPC_USB->DevIntSt & bmUSB_CommDataFullInterrupt) == 0);
      tmp = LPC_USB->CmdData;
      break;
    case CMD_USB_SET_EP_STAT:
      LPC_USB->CmdCode = (Data << 16) + USB_DATA_WR;
      while ((LPC_USB->DevIntSt & bmUSB_CommRegEmptyInterrupt) == 0);
      break;
    }
    break;
  }
  // restore the interrupt flags
  #if __CORE__ < 7
    EXT_CRT_SECTION(Save);
  #else
    EXT_CRT_SECTION();
  #endif // __CORE__ < 7
  return(tmp);
}

/*************************************************************************
 * Function Name: USB_EpIntrClr
 * Parameters: USB_Endpoint_t EndPoint
 *
 * Return: uint8_t
 *
 * Description: Clear the EP interrupt flag and return the current EP status
 *
 *************************************************************************/
static
uint8_t USB_EpIntrClr(USB_Endpoint_t EndPoint)
{
volatile uint32_t TO = 100;
#if __CORE__ < 7
uint32_t Save;
#endif // __CORE__ < 7
  // Disable interrupt and save current state of the interrupt flags
  #if __CORE__ < 7
    ENTR_CRT_SECTION(Save);
  #else
    ENTR_CRT_SECTION();
  #endif // __CORE__ < 7
  // the hardware will clear the CDFULL bit in the Device Interrupt Status register
  // LPC_USB->DevIntClr = bmUSB_CommDataFullInterrupt;

  LPC_USB->EpIntClr = 1 << EndPoint;
  // add some little delay may be is needed bacause the USB engine and Core
  // works on differents frequency domains
  __no_operation();
  __no_operation();
  while ((LPC_USB->DevIntSt & bmUSB_CommDataFullInterrupt) == 0)
  {
    assert(--TO);
  }
  #if __CORE__ < 7
    EXT_CRT_SECTION(Save);
  #else
    EXT_CRT_SECTION();
  #endif // __CORE__ < 7
  return(LPC_USB->CmdData);
}

/*************************************************************************
 * Function Name: USB_HwInit
 * Parameters: none
 *
 * Return: none
 *
 * Description: Init USB
 *
 *************************************************************************/
void USB_HwInit(void)
{  
  // Init SOF number hold
  #if  USB_SOF_EVENT > 0
  USB_SofNumbHold = 0;
  #endif

  /*Turn on USB*/
  LPC_SC->PCONP |= (1<<31);

  /*Assign  U1D+ and U1D- pin functions*/
  USB_DP_IOCON = 0x1;
  USB_DM_IOCON = 0x1;

  /*Enable Link LED (P1.18)*/
  USB_OTG_LINK_LED_IOCON = 0x21;

